In [2]:
# examples and exercises in chapter 4.3 of the Chinese version of book "Joyful Pandas" (pandas数据处理与分析)

In [3]:
import numpy as np
import pandas as pd

In [4]:
import os
os.chdir("../../")

In [5]:
# 4.3.1

In [6]:
example = pd.DataFrame({"A": list("aaabba"), "B": [3,6,5,2,1,7]})
example.groupby("A")["B"].cummax()

0    3
1    6
2    6
3    2
4    2
5    7
Name: B, dtype: int64

In [7]:
example.groupby("A")["A"].cumcount()

0    0
1    1
2    2
3    0
4    1
5    3
dtype: int64

In [18]:
# Ex4-7
example.groupby("A")["B"].rank()

0    1.0
1    3.0
2    2.0
3    2.0
4    1.0
5    4.0
Name: B, dtype: float64

In [19]:
df = pd.read_csv("data/learn_pandas.csv")
gb = df.groupby("Gender")[["Height", "Weight"]]
gb.transform(lambda x: (x-x.mean()) / x.std()).head()

     Height    Weight
0 -0.058760 -0.354888
1 -1.010925 -0.355000
2  2.167063  2.089498
3       NaN -1.279789
4  0.053133  0.159631

In [20]:
# Ex4-8

In [37]:
col_name = "Height"
method_name = "mean"

def my_transform(s):
    if s.name == col_name:
        return s.apply(method_name)
    else:
        return None

gb.transform(my_transform).head()

      Height  Weight
0  159.19697     NaN
1  173.62549     NaN
2  173.62549     NaN
3  159.19697     NaN
4  173.62549     NaN

In [38]:
gb.transform("mean").head()

      Height     Weight
0  159.19697  47.918519
1  173.62549  72.759259
2  173.62549  72.759259
3  159.19697  47.918519
4  173.62549  72.759259

In [42]:
example = pd.DataFrame({"A": list("aaabba"), "B": [3,6,5,2,1,7], "C": list("123456")})
example.groupby("A")["A"].transform(lambda x: 0 if x.name=="a" else 1)

0    0
1    0
2    0
3    1
4    1
5    0
Name: A, dtype: int64

In [41]:
example.groupby("A")[["A", "C"]].transform(lambda x: x.name)

   A  C
0  A  C
1  A  C
2  A  C
3  A  C
4  A  C
5  A  C

In [43]:
# 4.3.2

In [47]:
gb.filter(lambda x: x.shape[0] > 100).head()

   Height  Weight
0   158.9    46.0
3     NaN    41.0
5   158.0    51.0
6   162.5    52.0
7   161.9    50.0

In [48]:
# Ex4-9

In [55]:
demo = example.set_index("A")
demo.loc[["a"]]

   B  C
A
a  3  1
a  6  2
a  5  3
a  7  6

In [56]:
example.groupby("A").filter(lambda x: x.name in ["a"])

   A  B  C
0  a  3  1
1  a  6  2
2  a  5  3
5  a  7  6